#include <iostream>
using namespace std;
//схема работы
// Класс дерего.
// вложенный класс/структура node(узел)
// node состоит из right и left и самого значения data/value
// расписать функции для этого дерева:
//	1. Добавление (создание доп функции для работы с корнем и числом)
//	2. Поиск(создать доп функцию для поиска с корнем и значением)
//	3. Печать всего дерева в разных направлениях(использовать рекурсию NLR LNR LRN RNL)
//	4. описать конструктор и деструктор(для деструктора создать функцию поочередного удаления левого края потом правого края потом корня)
// 
//

int main()
{


	return 0;
}